app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new active: true
    @categories = Category.all

INSERT INTO "products" ("active", "category_id", "created_at", "description", "name", "price", "updated_at", "variant_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "categories".* FROM "categories"
---
  def create
    @product = Product.new params[:product]

    if @product.valid?
      @product.save
      return redirect_to products_path, notice: "Your product #{@product.name} has been created!"
    end

   @categories = Category.all

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
  def show
    @product = Product.find_by_id params[:id]

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
SELECT "categories".* FROM "categories"
---
  def edit
    @product = Product.find_by_id params[:id]
    @categories = Category.all

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "name" = 'Samsung Smart Tv', "description" = 'Tv Smart', "price" = 500.0, "updated_at" = '2013-01-27 22:29:23.552401' WHERE "products"."id" = 2
SELECT "categories".* FROM "categories"
---
  def update
    @product = Product.find_by_id params[:id]

    if @product.update_attributes params[:product]
      return redirect_to products_path, notice: "Your product #{@product.name} has been updated!"
    end

    @categories = Category.all