app/controllers/variants_controller.rb

SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = '1'
---
  def index
    @variants = Variant.where(:product_id => params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
INSERT INTO "variants" ("color", "created_at", "name", "product_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["color", "red"], ["created_at", Sun, 27 Jan 2013 00:11:40 UTC +00:00], ["name", "Excelent"], ["product_id", 1], ["updated_at", Sun, 27 Jan 2013 00:11:40 UTC +00:00]]
---
  def create
    @product = Product.find params[:product_id]
    @variant = Variant.new params[:variant]
    @product.variants << @variant

SELECT "variants".* FROM "variants" WHERE "variants"."id" = 4 LIMIT 1
UPDATE "variants" SET "name" = 'asdasdasd', "color" = 'asdadasdasd', "updated_at" = '2013-01-27 23:44:49.892459' WHERE "variants"."id" = 10
---
  def update
    @variant = Variant.find_by_id params[:id]

    if @variant.update_attributes params[:variant]

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
DELETE FROM "variants" WHERE "variants"."id" = $1  [["id", 5]]
SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = 1 AND "variants"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def show #action to show with delete
    @product = Product.find_by_id(params[:product_id])
    @product.variants.find(params[:id]).destroy

SELECT "variants".* FROM "variants" WHERE "variants"."variant_id" IS NULL
---
  def edit
    @variant = Variant.find_by_id params[:id]